samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
#include "sik_radio_test.h" 
#include "stm32f4xx_it.h" 

extern "C"
{
    // For C headers without C++ guards 
    #include "common/mavlink.h" 
}

//=======================================================================================


//=======================================================================================
// Macros 

// Buffer sizes 
#define SIK_TEST_MSG_BUFF_SIZE 1000 
#define SIK_TEST_MISSION_MAX_LEN 5 
#define SIK_TEST_NUM_PARAMS 5 

// System IDs - GCS IDs start at 255, vehicles start at 1 
#define SIK_TEST_SYS_ID 1 
#define SIK_TEST_GCS_ID 255 

// Periodic timing data 
// - ARR = Auto Reload Register - number of counts before periodic timer resets. 
// - SIK_TEST_PRESCALAR must coordinate with the timer_us_prescalars_t type used in the 
//   periodic timer init. 
// - SIK_TEST_INT_PERIOD is the period in ms of the periodic interrupt. This is used 
//   to find the timer count limit when the GCS requests a certain message rate. 
#define SIK_TEST_ARR 2500 
#define SIK_TEST_PRESCALAR 10000 
#define SIK_TEST_INT_PERIOD SIK_TEST_ARR * S_TO_MS / SIK_TEST_PRESCALAR 

#define SIK_TEST_HB_FREQ 1       // Heartbeat message send frequency 
#define SIK_TEST_PARAM_FREQ 4    // Parameter value message send frequency 
#define SIK_TEST_HB_TIMEOUT 40   // Heartbeat message timeout - adjust with interrupt period 
#define SIK_TEST_AT_TIMEOUT 20   // AT mode timeout - adjust with interrupt period 

// Mock data 
#define SIK_TEST_MOCK_BOOT_TIME 100 
#define SIK_TEST_MOCK_LAT 506132700 
#define SIK_TEST_MOCK_LON -1151237700 
#define SIK_TEST_MOCK_LAT_HOME 506132550 
#define SIK_TEST_MOCK_LON_HOME -1151204230 
#define SIK_TEST_MOCK_ALTITUDE 1 
#define SIK_TEST_MOCK_NUM_SATELLITES 4 
#define SIK_TEST_MOCK_WP_RADIUS 10 

//=======================================================================================


//=======================================================================================
// Global data 

// User & device serial interface data 
struct sik_serial_data_t 
{
    USART_TypeDef *uart; 
    DMA_Stream_TypeDef *dma_stream; 
    uint8_t cb[SIK_TEST_MSG_BUFF_SIZE];              // Circular buffer populated by DMA 
    cb_index_t cb_index;                             // Circular buffer indexing info 
    dma_index_t dma_index;                           // DMA transfer indexing info 
    uint8_t data_in_buff[SIK_TEST_MSG_BUFF_SIZE];    // Buffer that stores latest UART input 
    uint8_t data_out_buff[SIK_TEST_MSG_BUFF_SIZE];   // Buffer that stores outgoing data 
    uint16_t data_in_index;                          // Data input buffer index 
}; 

static sik_serial_data_t radio_data; 
static sik_serial_data_t user_data; 


// MAVLink message send timing info 
struct sik_msg_timing_t
{
    uint8_t count; 
    uint8_t count_lim; 
    uint8_t enable : 1; 
}; 


// MAVLink messages 
struct sik_mavlink_msgs_t 
{
    //==================================================
    // Incoming 

    // Heartbeat protocol 
    mavlink_heartbeat_t heartbeat_msg_gcs;                                   // HEARTBEAT 
    
    // Mission protocol 
    mavlink_mission_request_t mission_request_msg_gcs;                       // MISSION_REQUEST 
    mavlink_mission_count_t mission_count_msg_gcs;                           // MISSION_COUNT 
    mavlink_mission_item_int_t mission_item_int_msg_gcs;                     // MISSION_ITEM_INT 
    mavlink_mission_request_list_t mission_request_list_msg_gcs;             // MISSION_REQUEST_LIST 
    mavlink_mission_request_int_t mission_request_int_msg_gcs;               // MISSION_REQUEST_INT 
    mavlink_mission_ack_t mission_ack_msg_gcs;                               // MISSION_ACK 
    mavlink_mission_set_current_t mission_set_current_msg;                   // MISSION_SET_CURRENT 
    mavlink_mission_clear_all_t mission_clear_all_msg;                       // MISSION_CLEAR_ALL 
    
    // Parameter protocol 
    mavlink_param_request_list_t param_request_list_msg_gcs;                 // PARAM_REQUEST_LIST 
    mavlink_param_request_read_t param_request_read_msg_gcs;                 // PARAM_REQUEST_READ 
    mavlink_param_set_t param_set_msg_gcs;                                   // PARAM_SET 
    
    // Command protocol 
    mavlink_command_long_t command_long_msg_gcs;                             // COMMAND_LONG 
    
    // Other 
    mavlink_request_data_stream_t request_data_stream_msg_gcs;               // REQUEST_DATA_STREAM 
    
    //==================================================
    
    //==================================================
    // Outgoing 
    
    // Heartbeat protocol 
    mavlink_heartbeat_t heartbeat_msg;                                     // HEARTBEAT 
    
    // Mission protocol 
    mavlink_mission_count_t mission_count_msg;                             // MISSION_COUNT 
    mavlink_mission_item_int_t mission_item_int_msg;                       // MISSION_ITEM_INT 
    mavlink_mission_request_int_t mission_request_int_msg;                 // MISSION_REQUEST_INT 
    mavlink_mission_ack_t mission_ack_msg;                                 // MISSION_ACK 
    mavlink_mission_current_t mission_current_msg;                         // MISSION_CURRENT 
    mavlink_mission_item_reached_t mission_item_reached_msg;               // MISSION_ITEM_REACHED 
    
    // Parameter protocol 
    mavlink_param_value_t param_value_msg;                                 // PARAM_VALUE 
    
    // Command protocol 
    mavlink_command_ack_t command_ack_msg;                                 // COMMAND_ACK 
    
    // Periodic data stream messages 
    mavlink_raw_imu_t raw_imu_msg;                                         // RAW_IMU 
    mavlink_gps_raw_int_t gps_raw_int_msg;                                 // GPS_RAW_INT 
    mavlink_rc_channels_scaled_t rc_channels_scaled_msg;                   // RC_CHANNELS_SCALED 
    mavlink_rc_channels_raw_t rc_channels_raw_msg;                         // RC_CHANNELS_RAW 
    mavlink_servo_output_raw_t servo_output_raw_msg;                       // SERVO_OUTPUT_RAW 
    mavlink_attitude_t attitude_msg;                                       // ATTITUDE 
    mavlink_position_target_global_int_t position_target_global_int_msg;   // POSITION_TARGET_GLOBAL_INT 
    mavlink_nav_controller_output_t nav_controller_output_msg;             // NAV_CONTROLLER_OUTPUT 
    mavlink_local_position_ned_t local_position_ned_msg;                   // LOCAL_POSITION_NED 
    mavlink_global_position_int_t global_pos_int_msg;                      // GLOBAL_POSITION_INT 
    
