samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
    // Periodic outgoing message timing info 
    sik_msg_timing_t heartbeat_msg_timing;                                 // HEARTBEAT 
    sik_msg_timing_t raw_imu_msg_timing;                                   // RAW_IMU 
    sik_msg_timing_t gps_raw_int_msg_timing;                               // GPS_RAW_INT 
    sik_msg_timing_t rc_channels_scaled_msg_timing;                        // RC_CHANNELS_SCALED 
    sik_msg_timing_t rc_channels_raw_msg_timing;                           // RC_CHANNELS_RAW 
    sik_msg_timing_t servo_output_raw_msg_timing;                          // SERVO_OUTPUT_RAW 
    sik_msg_timing_t attitude_msg_timing;                                  // ATTITUDE 
    sik_msg_timing_t position_target_global_int_msg_timing;                // POSITION_TARGET_GLOBAL_INT 
    sik_msg_timing_t nav_controller_output_msg_timing;                     // NAV_CONTROLLER_OUTPUT 
    sik_msg_timing_t local_position_ned_msg_timing;                        // LOCAL_POSITION_NED 
    sik_msg_timing_t global_pos_int_msg_timing;                            // GLOBAL_POSITION_INT 
    sik_msg_timing_t param_value_msg_timing;                               // PARAM_VALUE 
    
    //==================================================
}; 


// System data 
class SikSystemData : public sik_mavlink_msgs_t 
{
public: 
    // MAVLink identification 
    int channel; 
    uint8_t system_id; 
    uint8_t component_id; 
    
    // MAVLink packet handling 
    mavlink_message_t msg; 
    mavlink_status_t status; 

    // Mission data 
    mavlink_mission_item_int_t mission[SIK_TEST_MISSION_MAX_LEN]; 
    uint16_t mission_size; 

    // Parameters 
    struct ParamInfo 
    {
        const char *name; 
        float value; 
        // Mission planner seems to only accept floats so 
        // no option for MAV_PARAM_TYPE is offered here. 
    };
    uint8_t param_index; 

    // Status timers 
    uint8_t heartbeat_status_timer; 
    uint8_t at_mode_request_timer; 

    // Status flags 
    uint8_t at_mode           : 1;   // AT command mode 
    uint8_t at_mode_requested : 1;   // AT command mode requested 
    uint8_t ui_mode           : 1;   // User input mode 
    uint8_t connected         : 1;   // Radio connected 
}; 

static SikSystemData system_data; 


const char 
// Formatting 
sik_test_user_prompt[] = "\r\n>>> ", 
sik_test_overwrite[] = "\r", 
// Feedback 
sik_test_user_msgid[] = "msgid: %lu\r\n", 
// Commands 
sik_test_user_exitui[] = "exitui", 
// Status 
sik_test_at_request[] = "Requesting AT command mode... ", 
sik_test_at_confirm[] = "OK\r\n", 
sik_test_timeout_msg[] = "timeout\r\n"; 


// See https://ardupilot.org/rover/docs/parameters.html#parameters for more details. 
static const SikSystemData::ParamInfo system_params[SIK_TEST_NUM_PARAMS] = 
{
    {"CRUISE_SPEED", 1.1},   // Target cruise speed in auto mode (m/s) 
    {"FRAME_CLASS",  2},     // Frame class: Boat 
    {"TURN_RADIUS",  1.0},   // Turn radius of vehicle (meters) 
    {"LOIT_TYPE",    0},     // Loiter type: Forward or reverse to target point 
    {"LOIT_RADIUS",  5.0}    // Loiter radius (meters) 
};

//=======================================================================================


//=======================================================================================
// Prototypes 

// Data initialization 
void sik_radio_test_init_data(void); 

/**
 * @brief AT command mode radio input decode 
 * 
 * @details Used to decode radio input when in AT command mode. This function doesn't so 
 *          much decode as it does echo the radio input to the serial terminal for the 
 *          user to see. It's labelled as a decoding function to better align with the 
 *          other input mode functions. 
 *          
 *          When a user inputs a valid AT command while in AT command mode, the radio 
 *          should respond with the requested info. Echoing this input helps the user 
 *          configure the radio as needed. 
 */
void sik_radio_test_at_radio_decode(void); 


/**
 * @brief MAVLink mode radio input decode 
 * 
 * @details Used to decode radio input while in MAVLink mode. This function is primarily 
 *          used to decode MAVLink messages received by the radio, however if in MAVLink 
 *          mode and the user requests to go to AT command mode, this function will check 
 *          if the radio responds with an acknowledgement that it has entere AT mode. 
 */
void sik_radio_test_mavlink_radio_decode(void); 


/**
 * @brief AT command mode user input decode 
 * 
 * @details Used to decode user input when in AT command mode. Some decoding is done to 
 *          check for specific user commands but if no match is found then the user input 
 *          is forwarded to the radio. This gives the user easy control over configuring 
 *          the radio. 
 */
void sik_radio_test_at_user_decode(void); 


/**
 * @brief MAVLink mode user input decode 
 * 
 * @details Used to decode user input when in MAVLink mode. A match to specific 
 *          predefined commands is checked for. If no match is found then nothing happens.
 *          When the system is in MAVLink mode and not in user input mode then any input 
 *          will trigger user input mode and nothing else. 
 */
void sik_radio_test_mavlink_user_decode(void); 


/**
 * @brief MAVLink message payload decode 
 * 
 * @details Decodes the payload of a received MAVLink message once the received radio 
 *          data is decoded into a complete MAVLink message. A function like this is 
 *          recommended by the MAVLink documentation for identifying and handling 
 *          messages. Different messages can be added as needed. 
 */
void sik_radio_test_mavlink_payload_decode(void); 

// MAVLink received message actions 
void sik_radio_test_mavlink_request_data_stream(void); 
void sik_radio_test_mavlink_param_request_list(void); 
void sik_radio_test_mavlink_mission_request(void); 
void sik_radio_test_mavlink_heartbeat(void); 
void sik_radio_test_mavlink_command_long(void); 


/**
 * @brief MAVlink mode periodic actions 
 * 
 * @details This function performs periodic actions when in MAVLink mode. 
 */
void sik_radio_test_mavlink_periodic(void); 

