samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
    system_data.channel = MAVLINK_COMM_0; 
    system_data.system_id = SIK_TEST_SYS_ID; 
    system_data.component_id = MAV_COMP_ID_AUTOPILOT1; 

    // Default home location 
    system_data.mission[BYTE_0].target_system = SIK_TEST_GCS_ID; 
    system_data.mission[BYTE_0].target_component = MAV_COMP_ID_MISSIONPLANNER; 
    system_data.mission[BYTE_0].seq = ZERO; 
    system_data.mission[BYTE_0].frame = MAV_FRAME_GLOBAL; 
    system_data.mission[BYTE_0].command = MAV_CMD_NAV_WAYPOINT; 
    system_data.mission[BYTE_0].current = ZERO; 
    system_data.mission[BYTE_0].autocontinue = ZERO; 
    system_data.mission[BYTE_0].param1 = ZERO; 
    system_data.mission[BYTE_0].param2 = SIK_TEST_MOCK_WP_RADIUS; 
    system_data.mission[BYTE_0].param3 = SIK_TEST_MOCK_WP_RADIUS; 
    system_data.mission[BYTE_0].param4 = ZERO; 
    system_data.mission[BYTE_0].x = SIK_TEST_MOCK_LAT_HOME; 
    system_data.mission[BYTE_0].y = SIK_TEST_MOCK_LON_HOME; 
    system_data.mission[BYTE_0].z = SIK_TEST_MOCK_ALTITUDE; 
    system_data.mission[BYTE_0].mission_type = MAV_MISSION_TYPE_MISSION; 
    system_data.mission_size = BYTE_1; 

    system_data.param_index = CLEAR; 
    
    system_data.heartbeat_status_timer = CLEAR; 
    system_data.at_mode_request_timer = CLEAR; 
    
    system_data.at_mode = CLEAR_BIT; 
    system_data.at_mode_requested = CLEAR_BIT; 
    system_data.ui_mode = CLEAR_BIT; 
    system_data.connected = CLEAR_BIT; 
    
    //==================================================
    
    //==================================================
    // MAVLink messages 

    // This test does not read from other devices to populate system information so dummy 
    // data is initialized here. There is no real reason for choosing specific numbers 
    // besides making them valid for the message. 

    // HEARTBEAT 
    system_data.heartbeat_msg.custom_mode = CLEAR; 
    system_data.heartbeat_msg.type = MAV_TYPE_SURFACE_BOAT; 
    system_data.heartbeat_msg.autopilot = MAV_AUTOPILOT_GENERIC_WAYPOINTS_ONLY; 
    system_data.heartbeat_msg.base_mode = MAV_MODE_FLAG_CUSTOM_MODE_ENABLED | 
                                          MAV_MODE_FLAG_MANUAL_INPUT_ENABLED | 
                                          MAV_MODE_FLAG_GUIDED_ENABLED | 
                                          MAV_MODE_FLAG_SAFETY_ARMED; 
    system_data.heartbeat_msg.system_status = MAV_STATE_ACTIVE; 

    system_data.heartbeat_msg_timing.count = CLEAR; 
    system_data.heartbeat_msg_timing.count_lim = S_TO_MS / (SIK_TEST_HB_FREQ * SIK_TEST_INT_PERIOD); 
    system_data.heartbeat_msg_timing.enable = SET_BIT; 
    
    // RAW_IMU 
    system_data.raw_imu_msg.time_usec = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.raw_imu_msg.xacc = ZERO; 
    system_data.raw_imu_msg.yacc = ZERO; 
    system_data.raw_imu_msg.zacc = 1; 
    system_data.raw_imu_msg.xgyro = ZERO; 
    system_data.raw_imu_msg.ygyro = ZERO; 
    system_data.raw_imu_msg.zgyro = ZERO; 
    system_data.raw_imu_msg.xmag = 1; 
    system_data.raw_imu_msg.ymag = ZERO; 
    system_data.raw_imu_msg.zmag = ZERO; 
    system_data.raw_imu_msg.id = ZERO; 
    system_data.raw_imu_msg.temperature = ZERO; 

    system_data.raw_imu_msg_timing.count = CLEAR; 
    system_data.raw_imu_msg_timing.count_lim = CLEAR; 
    system_data.raw_imu_msg_timing.enable = CLEAR_BIT; 
    
    // GPS_RAW_INT 
    system_data.gps_raw_int_msg.time_usec = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.gps_raw_int_msg.fix_type = GPS_FIX_TYPE_3D_FIX; 
    system_data.gps_raw_int_msg.lat = SIK_TEST_MOCK_LAT; 
    system_data.gps_raw_int_msg.lon = SIK_TEST_MOCK_LON; 
    system_data.gps_raw_int_msg.alt = SIK_TEST_MOCK_ALTITUDE; 
    system_data.gps_raw_int_msg.eph = HIGH_16BIT; 
    system_data.gps_raw_int_msg.epv = HIGH_16BIT; 
    system_data.gps_raw_int_msg.vel = HIGH_16BIT; 
    system_data.gps_raw_int_msg.cog = HIGH_16BIT; 
    system_data.gps_raw_int_msg.satellites_visible = SIK_TEST_MOCK_NUM_SATELLITES; 
    system_data.gps_raw_int_msg.alt_ellipsoid = SIK_TEST_MOCK_ALTITUDE; 
    system_data.gps_raw_int_msg.h_acc = ZERO; 
    system_data.gps_raw_int_msg.v_acc = ZERO; 
    system_data.gps_raw_int_msg.vel_acc = ZERO; 
    system_data.gps_raw_int_msg.hdg_acc = ZERO; 
    system_data.gps_raw_int_msg.yaw = ZERO; 

    system_data.gps_raw_int_msg_timing.count = CLEAR; 
    system_data.gps_raw_int_msg_timing.count_lim = CLEAR; 
    system_data.gps_raw_int_msg_timing.enable = CLEAR_BIT; 
    
    // RC_CHANNELS_SCALED 
    system_data.rc_channels_scaled_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.rc_channels_scaled_msg.port = ZERO; 
    system_data.rc_channels_scaled_msg.chan1_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan2_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan3_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan4_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan5_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan6_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan7_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan8_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.rssi = HIGH_8BIT; 

    system_data.rc_channels_scaled_msg_timing.count = CLEAR; 
    system_data.rc_channels_scaled_msg_timing.count_lim = CLEAR; 
    system_data.rc_channels_scaled_msg_timing.enable = CLEAR_BIT; 
    
    // RC_CHANNELS_RAW 
    system_data.rc_channels_raw_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.rc_channels_raw_msg.port = ZERO; 
    system_data.rc_channels_raw_msg.chan1_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan2_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan3_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan4_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan5_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan6_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan7_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan8_raw = ZERO; 
    system_data.rc_channels_raw_msg.rssi = HIGH_8BIT; 

    system_data.rc_channels_raw_msg_timing.count = CLEAR; 
    system_data.rc_channels_raw_msg_timing.count_lim = CLEAR; 
    system_data.rc_channels_raw_msg_timing.enable = CLEAR_BIT; 
    
    // SERVO_OUTPUT_RAW 
    system_data.servo_output_raw_msg.time_usec = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.servo_output_raw_msg.port = ZERO; 
    system_data.servo_output_raw_msg.servo1_raw = ZERO; 
    system_data.servo_output_raw_msg.servo2_raw = ZERO; 
    system_data.servo_output_raw_msg.servo3_raw = ZERO; 
    system_data.servo_output_raw_msg.servo4_raw = ZERO; 
    system_data.servo_output_raw_msg.servo5_raw = ZERO; 
    system_data.servo_output_raw_msg.servo6_raw = ZERO; 
    system_data.servo_output_raw_msg.servo7_raw = ZERO; 
    system_data.servo_output_raw_msg.servo8_raw = ZERO; 
    system_data.servo_output_raw_msg.servo9_raw = ZERO; 
    system_data.servo_output_raw_msg.servo10_raw = ZERO; 
    system_data.servo_output_raw_msg.servo11_raw = ZERO; 
    system_data.servo_output_raw_msg.servo12_raw = ZERO; 
    system_data.servo_output_raw_msg.servo13_raw = ZERO; 
    system_data.servo_output_raw_msg.servo14_raw = ZERO; 
    system_data.servo_output_raw_msg.servo15_raw = ZERO; 
    system_data.servo_output_raw_msg.servo16_raw = ZERO; 

    system_data.servo_output_raw_msg_timing.count = CLEAR; 
    system_data.servo_output_raw_msg_timing.count_lim = CLEAR; 
    system_data.servo_output_raw_msg_timing.enable = CLEAR_BIT; 
    
    // ATTITUDE 
    system_data.attitude_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.attitude_msg.roll = ZERO; 
    system_data.attitude_msg.pitch = ZERO; 
    system_data.attitude_msg.yaw = ZERO; 
    system_data.attitude_msg.rollspeed = ZERO; 
    system_data.attitude_msg.pitchspeed = ZERO; 
    system_data.attitude_msg.yawspeed = ZERO; 

    system_data.attitude_msg_timing.count = CLEAR; 
    system_data.attitude_msg_timing.count_lim = CLEAR; 
    system_data.attitude_msg_timing.enable = CLEAR_BIT; 
    
    // POSITION_TARGET_GLOBAL_INT 
    system_data.position_target_global_int_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.position_target_global_int_msg.coordinate_frame = MAV_FRAME_GLOBAL; 
    system_data.position_target_global_int_msg.type_mask = POSITION_TARGET_TYPEMASK_VX_IGNORE | 
                                                           POSITION_TARGET_TYPEMASK_VY_IGNORE | 
                                                           POSITION_TARGET_TYPEMASK_VZ_IGNORE |
                                                           POSITION_TARGET_TYPEMASK_AX_IGNORE | 
                                                           POSITION_TARGET_TYPEMASK_AY_IGNORE | 
                                                           POSITION_TARGET_TYPEMASK_AZ_IGNORE |
                                                           POSITION_TARGET_TYPEMASK_YAW_IGNORE | 
                                                           POSITION_TARGET_TYPEMASK_YAW_RATE_IGNORE | 
                                                           0xF000;
    system_data.position_target_global_int_msg.lat_int = SIK_TEST_MOCK_LAT; 
    system_data.position_target_global_int_msg.lon_int = SIK_TEST_MOCK_LON; 
    system_data.position_target_global_int_msg.alt = SIK_TEST_MOCK_ALTITUDE; 
    system_data.position_target_global_int_msg.vx = ZERO; 
    system_data.position_target_global_int_msg.vy = ZERO; 
    system_data.position_target_global_int_msg.vz = ZERO; 
    system_data.position_target_global_int_msg.afx = ZERO; 
    system_data.position_target_global_int_msg.afy = ZERO; 
    system_data.position_target_global_int_msg.afz = ZERO; 
    system_data.position_target_global_int_msg.yaw = ZERO; 
    system_data.position_target_global_int_msg.yaw_rate = ZERO; 

    system_data.position_target_global_int_msg_timing.count = CLEAR; 
    system_data.position_target_global_int_msg_timing.count_lim = CLEAR; 
    system_data.position_target_global_int_msg_timing.enable = CLEAR_BIT; 
    
    // NAV_CONTROLLER_OUTPUT 
    system_data.nav_controller_output_msg.nav_roll = ZERO; 
    system_data.nav_controller_output_msg.nav_pitch = ZERO; 
    system_data.nav_controller_output_msg.nav_bearing = ZERO; 
    system_data.nav_controller_output_msg.target_bearing = ZERO; 
    system_data.nav_controller_output_msg.wp_dist = 200; 
    system_data.nav_controller_output_msg.alt_error = ZERO; 
    system_data.nav_controller_output_msg.aspd_error = ZERO; 
    system_data.nav_controller_output_msg.xtrack_error = ZERO; 

    system_data.nav_controller_output_msg_timing.count = CLEAR; 
    system_data.nav_controller_output_msg_timing.count_lim = CLEAR; 
    system_data.nav_controller_output_msg_timing.enable = CLEAR_BIT; 
    
    // LOCAL_POSITION_NED 
    system_data.local_position_ned_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.local_position_ned_msg.x = ZERO; 
    system_data.local_position_ned_msg.y = ZERO; 
    system_data.local_position_ned_msg.z = ZERO; 
    system_data.local_position_ned_msg.vx = ZERO; 
    system_data.local_position_ned_msg.vy = ZERO; 
    system_data.local_position_ned_msg.vz = ZERO; 

    system_data.local_position_ned_msg_timing.count = CLEAR; 
    system_data.local_position_ned_msg_timing.count_lim = CLEAR; 
    system_data.local_position_ned_msg_timing.enable = CLEAR_BIT; 
    
    // GLOBAL_POSITION_INT 
    system_data.global_pos_int_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.global_pos_int_msg.lat = SIK_TEST_MOCK_LAT; 
    system_data.global_pos_int_msg.lon = SIK_TEST_MOCK_LON; 
    system_data.global_pos_int_msg.alt = SIK_TEST_MOCK_ALTITUDE; 
    system_data.global_pos_int_msg.relative_alt = SIK_TEST_MOCK_ALTITUDE; 
    system_data.global_pos_int_msg.vx = ZERO; 
    system_data.global_pos_int_msg.vy = ZERO; 
    system_data.global_pos_int_msg.vx = ZERO; 
    system_data.global_pos_int_msg.hdg = ZERO; 

    system_data.global_pos_int_msg_timing.count = CLEAR; 
    system_data.global_pos_int_msg_timing.count_lim = CLEAR; 
    system_data.global_pos_int_msg_timing.enable = CLEAR_BIT; 

    // PARAM_VALUE 
    system_data.param_value_msg_timing.count = CLEAR; 
    system_data.param_value_msg_timing.count_lim = S_TO_MS / (SIK_TEST_PARAM_FREQ * SIK_TEST_INT_PERIOD); 
    system_data.param_value_msg_timing.enable = CLEAR_BIT; 
    
    //==================================================
}

//=======================================================================================


//=======================================================================================
// Test code 

void sik_radio_test_app(void)
{
    // New SiK radio module data received 
    if (handler_flags.usart1_flag)
    {
        handler_flags.usart1_flag = CLEAR_BIT; 

        // Parse the new radio data from the circular buffer into the data buffer. 
        dma_cb_index(radio_data.dma_stream, &radio_data.dma_index, &radio_data.cb_index); 
        cb_parse(radio_data.cb, &radio_data.cb_index, radio_data.data_in_buff); 

        // Choose an action based on whether the radio is in AT command mode or not. 
        if (system_data.at_mode)
        {
            sik_radio_test_at_radio_decode(); 
        }
        else 
        {
            sik_radio_test_mavlink_radio_decode(); 
        }
    }

