samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
        case MAVLINK_MSG_ID_MISSION_REQUEST: 
            sik_radio_test_mavlink_mission_request(); 
            break; 

        case MAVLINK_MSG_ID_REQUEST_DATA_STREAM: 
            sik_radio_test_mavlink_request_data_stream(); 
            break; 
        
        case MAVLINK_MSG_ID_COMMAND_LONG: 
            // Call a separate function to decode mavlink_command_long_t.command 
            sik_radio_test_mavlink_command_long(); 
            break; 
        
        default: 
            break; 
    }
}


// MAVLink HEARTBEAT message actions 
void sik_radio_test_mavlink_heartbeat(void)
{
    mavlink_msg_heartbeat_decode(
        &system_data.msg, 
        &system_data.heartbeat_msg_gcs); 

    // This system is only concerned with heartbeats from the GCS it's communicating with. 
    // The system considers itself connected only if the heatbeat message type and source 
    // are correct. 
    if ((system_data.heartbeat_msg_gcs.type == MAV_TYPE_GCS) && 
        (system_data.heartbeat_msg_gcs.autopilot == MAV_AUTOPILOT_INVALID) && 
        (system_data.msg.sysid == SIK_TEST_GCS_ID) && 
        (system_data.msg.compid == MAV_COMP_ID_MISSIONPLANNER))
    {
        system_data.heartbeat_status_timer = CLEAR; 
        system_data.connected = SET_BIT; 
    }
}


// MAVLink PARAM_REQUEST_LIST message actions 
void sik_radio_test_mavlink_param_request_list(void)
{
    mavlink_msg_param_request_list_decode(
        &system_data.msg, 
        &system_data.param_request_list_msg_gcs); 

    // This system is only concerned with messages meant for this system. If the taget 
    // system and component ID in the message does not match this system then abort. 
    if ((system_data.param_request_list_msg_gcs.target_system != system_data.system_id) || 
        (system_data.param_request_list_msg_gcs.target_component != system_data.component_id))
    {
        return; 
    }

    // Enable the PARAM_VALUE message which gets sent periodically until all parameters 
    // in the system have been sent. 
    system_data.param_value_msg_timing.enable = SET_BIT; 
    system_data.param_index = CLEAR; 
}


// MAVLink MISSION_REQUEST message actions 
void sik_radio_test_mavlink_mission_request(void)
{
    // Mission planner sends MISSION_REQUEST messages despite the message being 
    // deprecated by MAVLink in favour of MISSION_REQUEST_INT. When this message is 
    // received, Mission Planner expects MISSION_ITEM_INT in return as discovered through 
    // trial and error (i.e. MISSION_ITEM does not work). 
    // MISSION_ITEM_INT takes the system and component IDs in its payload of the system 
    // the message is being sent to. This should not be confused with the full MAVLink 
    // message system and component IDs which identify where a message is coming from. 
    // Mission Planner varries from standard MAVLink mission protocol in that the item 
    // at mission sequence 0 is the home location, not the first waypoint location. 

    mavlink_msg_mission_request_decode(
        &system_data.msg, 
        &system_data.mission_request_msg_gcs); 

    // This system is only concerned with messages meant for this system. If the taget 
    // system and component ID in the message does not match this system then abort. 
    if ((system_data.mission_request_msg_gcs.target_system != system_data.system_id) || 
        (system_data.mission_request_msg_gcs.target_component != system_data.component_id))
    {
        return; 
    }

    // Only send the mission item if it exists 
    if (system_data.mission_request_msg_gcs.seq < system_data.mission_size)
    {
        memcpy((void *)&system_data.mission_item_int_msg, 
               (void *)&system_data.mission[system_data.mission_request_msg_gcs.seq], 
               sizeof(mavlink_mission_item_int_t)); 
        system_data.mission_item_int_msg.target_system = SIK_TEST_GCS_ID; 
        system_data.mission_item_int_msg.target_component = MAV_COMP_ID_MISSIONPLANNER; 

        mavlink_msg_mission_item_int_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.mission_item_int_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }
}


// MAVLink REQUEST_DATA_STREAM message actions 
void sik_radio_test_mavlink_request_data_stream(void)
{
    // Mission Planner sends this message to request data from the autopilot. This 
    // message is often sent in bursts to request all the needed messages. 

    mavlink_msg_request_data_stream_decode(
        &system_data.msg, 
        &system_data.request_data_stream_msg_gcs); 
    
    // This system is only concerned with messages meant for this system. If the taget 
    // system and component ID in the message does not match this system then abort. 
    if ((system_data.request_data_stream_msg_gcs.target_system != system_data.system_id) || 
        (system_data.request_data_stream_msg_gcs.target_component != system_data.component_id))
    {
        return; 
    }

    // This message comes with a cooresponding requested message rate. The calculated 
    // timer counter limit is the same calculation for each requested message so it's 
    // done once here and assigned to the requested message. Note that the periodic 
    // interrupt period should be equipped to handle whatever the requested rate is. 
    uint8_t timer_limit = (uint8_t)(S_TO_MS / 
        (system_data.request_data_stream_msg_gcs.req_message_rate * SIK_TEST_INT_PERIOD)); 
    uint8_t enable = system_data.request_data_stream_msg_gcs.start_stop; 

    // Enable/disable the requested message and assign the message timer counter limit 
    // so it gets sent to the GCS at the requested rate. 
    switch (system_data.request_data_stream_msg_gcs.req_stream_id)
    {
        case MAV_DATA_STREAM_ALL: 
            break; 
        
        case MAV_DATA_STREAM_RAW_SENSORS: 
            system_data.raw_imu_msg_timing.enable = enable; 
            system_data.raw_imu_msg_timing.count_lim = timer_limit; 
            system_data.gps_raw_int_msg_timing.enable = enable; 
            system_data.gps_raw_int_msg_timing.count_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_EXTENDED_STATUS: 
            break; 

        case MAV_DATA_STREAM_RC_CHANNELS: 
            system_data.rc_channels_scaled_msg_timing.enable = enable; 
            system_data.rc_channels_scaled_msg_timing.count_lim = timer_limit; 
            system_data.rc_channels_raw_msg_timing.enable = enable; 
            system_data.rc_channels_raw_msg_timing.count_lim = timer_limit; 
            system_data.servo_output_raw_msg_timing.enable = enable; 
            system_data.servo_output_raw_msg_timing.count_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_RAW_CONTROLLER: 
            system_data.attitude_msg_timing.enable = enable; 
            system_data.attitude_msg_timing.count_lim = timer_limit; 
            system_data.position_target_global_int_msg_timing.enable = enable; 
            system_data.position_target_global_int_msg_timing.count_lim = timer_limit; 
            system_data.nav_controller_output_msg_timing.enable = enable; 
            system_data.nav_controller_output_msg_timing.count_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_POSITION: 
            system_data.local_position_ned_msg_timing.enable = enable; 
            system_data.local_position_ned_msg_timing.count_lim = timer_limit; 
            system_data.global_pos_int_msg_timing.enable = enable; 
            system_data.global_pos_int_msg_timing.count_lim = timer_limit; 
            break; 

