samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
        case MAV_DATA_STREAM_EXTRA1: 
            break; 

        case MAV_DATA_STREAM_EXTRA2: 
            break; 

        case MAV_DATA_STREAM_EXTRA3: 
            break; 

        default: 
            break; 
    }
}


// MAVLink COMMAND_LONG message actions 
void sik_radio_test_mavlink_command_long(void)
{
    mavlink_msg_command_long_decode(
        &system_data.msg, 
        &system_data.command_long_msg_gcs); 

    // This system is only concerned with messages meant for this system. If the taget 
    // system and component ID in the message does not match this system then abort. 
    if ((system_data.command_long_msg_gcs.target_system != system_data.system_id) || 
        (system_data.command_long_msg_gcs.target_component != system_data.component_id))
    {
        return; 
    }

    // Acknowledge the command. 
    mavlink_msg_command_ack_pack_chan(
        system_data.system_id, 
        system_data.component_id, 
        system_data.channel, 
        &system_data.msg, 
        system_data.command_long_msg_gcs.command, 
        MAV_RESULT_ACCEPTED, 
        system_data.command_ack_msg.progress, 
        system_data.command_ack_msg.result_param2, 
        SIK_TEST_GCS_ID, 
        MAV_COMP_ID_MISSIONPLANNER); 
    sik_radio_test_mavlink_send_msg(); 

    // Emit response to command if required. 

    snprintf((char *)user_data.data_out_buff, 
        SIK_TEST_MSG_BUFF_SIZE, 
        "command: %u, confirm: %u, p1: %f, p2: %f, p3: %f, p4: %f, p5: %f, p6: %f, p7: %f\r\n", 
        system_data.command_long_msg_gcs.command, 
        system_data.command_long_msg_gcs.confirmation, 
        system_data.command_long_msg_gcs.param1, 
        system_data.command_long_msg_gcs.param2, 
        system_data.command_long_msg_gcs.param3, 
        system_data.command_long_msg_gcs.param4, 
        system_data.command_long_msg_gcs.param5, 
        system_data.command_long_msg_gcs.param6, 
        system_data.command_long_msg_gcs.param7); 
    sik_radio_test_user_output((char *)user_data.data_out_buff); 
}

//=======================================================================================


//=======================================================================================
// Periodic actions 

// MAVlink mode periodic actions 
void sik_radio_test_mavlink_periodic(void)
{
    // Everything here is performed periodically when in MAVLink mode. 
    sik_radio_test_mavlink_periodic_timeout(); 
    sik_radio_test_mavlink_periodic_send(); 
}


// MAVLink periodic timeout check 
void sik_radio_test_mavlink_periodic_timeout(void)
{
    // Check for a connection (heartbeat) timeout 
    if (system_data.heartbeat_status_timer++ >= SIK_TEST_HB_TIMEOUT)
    {
        // Have not seen a heartbeat message from a GCS for too long. The system is 
        // considered to be disconnected. 
        system_data.heartbeat_status_timer--; 
        system_data.connected = CLEAR_BIT; 
    }

    // Check for an AT command mode request timeout 
    if (system_data.at_mode_requested)
    {
        // If AT command mode is being requested then the code waits on the appropriate 
        // response from the radio. Waiting for this response blocks other actions so 
        // once the system has waited too long then cancel the search and return to 
        // normal MAVLink mode. 
        if (system_data.at_mode_request_timer++ >= SIK_TEST_AT_TIMEOUT)
        {
            sik_radio_test_at_request_reset(sik_test_timeout_msg); 
            sik_at_mode(SIK_AT_EXIT); 
        }
    }
}


// MAVLink message periodic send 
void sik_radio_test_mavlink_periodic_send(void)
{
    // Check if any of the enabled periodic messages must be sent. 

    // HEARTBEAT 
    if (system_data.heartbeat_msg_timing.enable && 
       (++system_data.heartbeat_msg_timing.count >= 
          system_data.heartbeat_msg_timing.count_lim))
    {
        system_data.heartbeat_msg_timing.count = CLEAR; 
        mavlink_msg_heartbeat_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.heartbeat_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // RAW_IMU 
    if (system_data.raw_imu_msg_timing.enable && 
       (++system_data.raw_imu_msg_timing.count >= 
          system_data.raw_imu_msg_timing.count_lim))
    {
        system_data.raw_imu_msg_timing.count = CLEAR; 
        mavlink_msg_raw_imu_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.raw_imu_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // GPS_RAW_INT 
    if (system_data.gps_raw_int_msg_timing.enable && 
       (++system_data.gps_raw_int_msg_timing.count >= 
          system_data.gps_raw_int_msg_timing.count_lim))
    {
        system_data.gps_raw_int_msg_timing.count = CLEAR; 
        mavlink_msg_gps_raw_int_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.gps_raw_int_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // RC_CHANNELS_SCALED 
    if (system_data.rc_channels_scaled_msg_timing.enable && 
       (++system_data.rc_channels_scaled_msg_timing.count >= 
          system_data.rc_channels_scaled_msg_timing.count_lim))
    {
        system_data.rc_channels_scaled_msg_timing.count = CLEAR; 
        mavlink_msg_rc_channels_scaled_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.rc_channels_scaled_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // RC_CHANNELS_RAW 
    if (system_data.rc_channels_raw_msg_timing.enable && 
       (++system_data.rc_channels_raw_msg_timing.count >= 
          system_data.rc_channels_raw_msg_timing.count_lim))
    {
        system_data.rc_channels_raw_msg_timing.count = CLEAR; 
        mavlink_msg_rc_channels_raw_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.rc_channels_raw_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // SERVO_OUTPUT_RAW 
    if (system_data.servo_output_raw_msg_timing.enable && 
       (++system_data.servo_output_raw_msg_timing.count >= 
          system_data.servo_output_raw_msg_timing.count_lim))
    {
        system_data.servo_output_raw_msg_timing.count = CLEAR; 
        mavlink_msg_servo_output_raw_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.servo_output_raw_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // ATTITUDE 
    if (system_data.attitude_msg_timing.enable && 
       (++system_data.attitude_msg_timing.count >= 
          system_data.attitude_msg_timing.count_lim))
    {
        system_data.attitude_msg_timing.count = CLEAR; 
        mavlink_msg_attitude_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.attitude_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // POSITION_TARGET_GLOBAL_INT 
    if (system_data.position_target_global_int_msg_timing.enable && 
       (++system_data.position_target_global_int_msg_timing.count >= 
          system_data.position_target_global_int_msg_timing.count_lim))
    {
        system_data.position_target_global_int_msg_timing.count = CLEAR; 
        mavlink_msg_position_target_global_int_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.position_target_global_int_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // NAV_CONTROLLER 
    if (system_data.nav_controller_output_msg_timing.enable && 
       (++system_data.nav_controller_output_msg_timing.count >= 
          system_data.nav_controller_output_msg_timing.count_lim))
    {
        system_data.nav_controller_output_msg_timing.count = CLEAR; 
        mavlink_msg_nav_controller_output_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.nav_controller_output_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // LOCAL_POSITION_NED 
    if (system_data.local_position_ned_msg_timing.enable && 
       (++system_data.local_position_ned_msg_timing.count >= 
          system_data.local_position_ned_msg_timing.count_lim))
    {
        system_data.local_position_ned_msg_timing.count = CLEAR; 
        mavlink_msg_local_position_ned_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.local_position_ned_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // GLOBAL_POSITION_INT 
    if (system_data.global_pos_int_msg_timing.enable && 
       (++system_data.global_pos_int_msg_timing.count >= 
          system_data.global_pos_int_msg_timing.count_lim))
    {
        system_data.global_pos_int_msg_timing.count = CLEAR; 
        mavlink_msg_global_position_int_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.global_pos_int_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

