samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
    // PARAM_VALUE (response to PARAM_REQUEST_LIST) 
    if (system_data.param_value_msg_timing.enable && 
       (++system_data.param_value_msg_timing.count >= 
          system_data.param_value_msg_timing.count_lim))
    {
        system_data.param_value_msg_timing.count = CLEAR; 

        if (system_data.param_index < SIK_TEST_NUM_PARAMS)
        {
            mavlink_msg_param_value_pack_chan(
                system_data.system_id, 
                system_data.component_id, 
                system_data.channel, 
                &system_data.msg, 
                system_params[system_data.param_index].name, 
                system_params[system_data.param_index].value, 
                MAV_PARAM_TYPE_REAL32, 
                SIK_TEST_NUM_PARAMS, 
                system_data.param_index); 
            sik_radio_test_mavlink_send_msg(); 

            system_data.param_index++; 
        }
        else 
        {
            system_data.param_value_msg_timing.enable = CLEAR_BIT; 
        }
     }
}

//=======================================================================================


//=======================================================================================
// Helper functions 

// User prompt 
void sik_radio_test_user_output(const char *user_msg)
{
    uart_send_str(user_data.uart, user_msg); 
}


// AT command mode request reset 
void sik_radio_test_at_request_reset(const char *user_msg)
{
    system_data.at_mode_request_timer = CLEAR; 
    system_data.at_mode_requested = CLEAR_BIT; 
    sik_radio_test_user_output(user_msg); 
    sik_radio_test_user_output(sik_test_user_prompt); 
}


// Serialize and send MAVLink message 
void sik_radio_test_mavlink_send_msg(void)
{
    sik_send_data(radio_data.data_out_buff, 
                  mavlink_msg_to_send_buffer(radio_data.data_out_buff, &system_data.msg)); 
}

//=======================================================================================
